# St7SetNLAPseudoTime

Assigns the pseudo time to the specified increment for nonlinear static analysis.

long St7SetNLAPseudoTime(long uID, long Stage, long Increment, double Time)

Input Parameters

uID

Strand7 model file ID.

Stage

Stage index – use 0 for unstaged analysis.

Increment

Increment number.

Time

Pseudo time.